src/app/controllers/account_controller.rb

SELECT "households".* FROM "households" WHERE "households"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @user_id = current_user.id if current_user.present?
    if @user_id
      @user_household = Household.find_by(user_id: @user_id)
      @qr_code_url = generate_qr_code_url(@user_household.id) if @user_household.present?
      @qr_code = generate_qr_code(@qr_code_url) if @qr_code_url.present?
    else
      # Handle the case when current_user is nil
    end

    @client = current_user.client if current_user.present?