src/app/controllers/application_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def switch_locale(&action)
    if not current_user.nil?
      if params.has_key? :locale
        current_user.locale = params[:locale]
        current_user.save