src/app/controllers/booker_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @client = current_user.client if current_user.present?