src/app/controllers/clients_controller.rb

    def update
      @client = Client.find(params[:id])
      if @client.update(client_params)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "clients" SET "address" = $1, "language" = $2, "religion" = $3 WHERE "clients"."id" = $4  [["address", "123 Example Street"], ["language", "English"], ["religion", "Christian"], ["id", 2]]

    def create
      cparams = client_params
      puts cparams
      cparams[:dob] = Date.strptime(cparams[:dob], '%m/%d/%Y')
      puts cparams
      @client = Client.new(cparams)
      if @client.save
        current_user.client = @client
        current_user.save
---
INSERT INTO "clients" ("first_name", "last_name", "dob", "address", "language", "religion", "restrictions", "allergy_peanuts", "allergy_treenuts", "allergy_eggs", "allergy_milk", "allergy_shellfish", "allergy_fish", "allergy_wheat", "allergy_soy", "gluten_free", "vegan") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
UPDATE "users" SET "client_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["client_id", 2], ["updated_at", "2024-04-14 12:44:09.381956"], ["id", 3]]