src/app/controllers/graphs_controller.rb

SELECT "admin_panels".* FROM "admin_panels" ORDER BY "admin_panels"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."location" = $1 AND "appointments"."date_of_appts" = $2  [["location", "Trenton"], ["date_of_appts", "2024-04-15"]]
---
  def wait_time_graph(location)
    current_date= Date.today
    @location=location
    @wait_times={}
    admin_panel = AdminPanel.first

    @appointments= Appointment.where(location: location, date_of_appts: current_date)


    @appointments.each do |appointment|