src/app/controllers/households_controller.rb

SELECT "households".* FROM "households"
---
  def index
    @households = Household.all

INSERT INTO "households" ("headname", "headdob", "headgender", "headethnicity", "numadults", "numchild", "streetaddr", "city", "state", "county", "zipcode", "phonenum", "incomesource", "qualifiercode", "netincome", "householdtype", "foodstamps", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
UPDATE "users" SET "registered" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["registered", true], ["updated_at", "2024-04-14 12:47:10.960739"], ["id", 3]]
---
  def create
    if current_user.registered == false
      @household = Household.new(household_params)
      @household.user_id = current_user.id

      respond_to do |format|
        if @household.save
          format.html { redirect_to household_url(@household), notice: "Household was successfully created." }
          format.json { render :show, status: :created, location: @household }
        else
          format.html { render :new, status: :unprocessable_entity }
          format.json { render json: @household.errors, status: :unprocessable_entity }
        end
      end
      current_user.update(registered: true)

DELETE FROM "households" WHERE "households"."id" = $1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    @household.destroy

    user_id = @household.user_id

    respond_to do |format|
      format.html { redirect_to households_url, notice: "Household was successfully destroyed." }
      format.json { head :no_content }
    end

    user = User.find_by_id(id: user_id)

SELECT "households".* FROM "households" WHERE "households"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_household
      @household = Household.find(params[:id])