src/app/controllers/volunteers_controller.rb

  def upcoming_hours
    @volunteer_assignments = VolunteerAssignment.includes(:volunteer, :role, :time_slot).all
---
SELECT "volunteer_assignments".* FROM "volunteer_assignments"