src/app/views/booker/new.html.erb

    <h2>Existing Appointment(s)</h2>
    <% if @client.appointments.any? %>
---
SELECT 1 AS one FROM "appointments" WHERE "appointments"."client_id" = $1 LIMIT $2  [["client_id", 3], ["LIMIT", 1]]